var sessionTabelInfo = [
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	}
]

jQuery(document).ready(function() {

	// hide placeloder calendar in Safari br
	{
		if (navigator.userAgent.search("Safari") >= 0 && navigator.userAgent.search("Chrome") < 0) {  
			jQuery("#makredIdAddressAndSession .sessionStartEnd label > input").attr('placeholder', '');
		}
	}

	// calendar Session
	jQuery('#startSession').dateTimePicker({
        monthName: ['Հունվ', 'Փետ', 'Մարտ', 'Ապր', 'Մայ', 'Հունի', 'Հուլ', 'Օգոս', 'Սեպ', 'Հոկ', 'Նոյ', 'Դեկ'], 
        dayName: ['Կրի', 'Երկ', 'Երեք', 'Չոր', 'Հինգ', 'Ուրբ', 'Շաբ'],
        limitMax: jQuery('#endSession') 
    });
	jQuery('#endSession').dateTimePicker({
        monthName: ['Հունվ', 'Փետ', 'Մարտ', 'Ապր', 'Մայ', 'Հունի', 'Հուլ', 'Օգոս', 'Սեպ', 'Հոկ', 'Նոյ', 'Դեկ'], 
        dayName: ['Կրի', 'Երկ', 'Երեք', 'Չոր', 'Հինգ', 'Ուրբ', 'Շաբ'],
        limitMin: $('#startSession') 
    });

	// table Info Session
    if(jQuery(window).width() > 1200){
    	pcTabelVersion();
    }else{
    	smartTabelVersion();
    }

    jQuery(window).resize(function(event) {
		if(jQuery(window).width() > 1200){
	    	pcTabelVersion();
	    }else{
    		smartTabelVersion();
	    }
    });

});


function pcTabelVersion(){
	var tabel = "";
    	tabel = "<table class='pctable'>\n<tr>";
    	for(var i in sessionTabelInfo[0]){
    		tabel += "\n\t<th class='th'>"+i+"</th>\n";
    	}
    	tabel += "\n</tr>";

    	for(var i in sessionTabelInfo){
    		tabel += "\n<tr class='tr'>";
    		for(var j in sessionTabelInfo[i]){
    			tabel += "\n\t<td class='td'>"+sessionTabelInfo[i][j]+"</td>\n";
    		}
    		tabel += "</tr>\n";
    	}
    	tabel += "\n</table>";
    	console.log(tabel)
    	jQuery("#tabelSession").html(tabel);
}

function smartTabelVersion(){
	var tabel = "";

    for(var i in sessionTabelInfo){
    	tabel += "<table class='smarttable'>\n";
    	tabel += "\n\t<tr class='tr'>\n\t<td class='td'>\t\t<span class='th'>" + "Համար " + "\t\t</span>"+sessionTabelInfo[i]["Համար"]+ "<span class='th'>"+ "Վաճառքը " + "</span>"+sessionTabelInfo[i]["Վաճառքը (Գինը)"]+"Դ / "+sessionTabelInfo[i]["Վաճառքը (Լիտր)"] + "Լ" + "\t\n</td>\t\n</tr>" ;
    	tabel += "\n\t<tr class='tr'>\n\t<td class='td'>\t\t<span class='th'>" + "Միացում " + "\t\t</span>"+sessionTabelInfo[i]["Միացման սկիզբը"]+ " - " + sessionTabelInfo[i]["Միացման ավարտը"] + "\t\n</td>\t\n</tr>" ;
    	tabel += "\n\t<tr class='tr'>\n\t<td class='td'>\t\t<span class='th'>" + "Գրառում " + "\t\t</span>"+sessionTabelInfo[i]["Գրառում"]+ "\t\n</td>\t\n</tr>" ;
    	tabel += "\n</table>";
	}

    jQuery("#tabelSession").html(tabel);
}