var sessionTabelInfo = [
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},
	{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	},{
		"Համար": 1312649840689,
		"Միացման սկիզբը": "2019-01-01 14.50",
		"Միացման ավարտը": "2019-01-02 14.50",
		"Գրառում": "Գրառում",
		"Վաճառքը (Լիտր)": "11,000",
		"Վաճառքը (Գինը)": "550,000"
	}
]

jQuery(document).ready(function() {

	// calendar Session
	jQuery('#startSession').dateTimePicker({
        monthName: ['Հունվ', 'Փետ', 'Մարտ', 'Ապր', 'Մայ', 'Հունի', 'Հուլ', 'Օգոս', 'Սեպ', 'Հոկ', 'Նոյ', 'Դեկ'], 
        dayName: ['Կրի', 'Երկ', 'Երեք', 'Չոր', 'Հինգ', 'Ուրբ', 'Շաբ'],
        limitMax: jQuery('#endSession') 
    });
	jQuery('#endSession').dateTimePicker({
        monthName: ['Հունվ', 'Փետ', 'Մարտ', 'Ապր', 'Մայ', 'Հունի', 'Հուլ', 'Օգոս', 'Սեպ', 'Հոկ', 'Նոյ', 'Դեկ'], 
        dayName: ['Կրի', 'Երկ', 'Երեք', 'Չոր', 'Հինգ', 'Ուրբ', 'Շաբ'],
        limitMin: $('#startSession') 
    });

	// table Info Session
    if(jQuery(window).width() > 1200){
    	var tabel = "";
    	tabel = "<table class='table'>\n<tr>";
    	for(var i in sessionTabelInfo[0]){
    		tabel += "\n\t<th class='th'>"+i+"</th>\n";
    	}
    	tabel += "\n</tr>";

    	for(var i in sessionTabelInfo){
    		tabel += "\n<tr class='tr'>";
    		for(var j in sessionTabelInfo[i]){
    			tabel += "\n\t<td class='td'>"+sessionTabelInfo[i][j]+"</td>\n";
    		}
    		tabel += "</tr>\n";
    	}
    	tabel += "\n</table>";
    	console.log(tabel)
    	jQuery("#tabelSession").html(tabel);
    }else{
    	var tabel = "";
    	tabel +="This is not the end, debugging soon!!! \n"

    	for(var i in sessionTabelInfo){
    		tabel += "<table class='table'>\n";
    		for(var j in sessionTabelInfo[i]){
    			tabel += "\n\t<tr class='tr'>\t<td class='td'><span class='th'>"+j+"</span>"+sessionTabelInfo[i][j]+"</td>\n\t</tr>";
    		}
    		tabel += "\n</table>";

    	}
    	console.log(tabel)
    	jQuery("#tabelSession").html(tabel);
    }

});