var transferTabelInfo = [
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	},
	{
		"Համար": 1312649840689,
		"N-րդ մեքենան": "***",
		"From": "***",
		"Որտեղ": "***",
		"Մեկնում": "***",
		"Լիտր": "***",
		"Կարգավիճակը": "***"
	}
]

jQuery(document).ready(function() {

	// hide placeloder calendar in Safari br
	{
		if (navigator.userAgent.search("Safari") >= 0 && navigator.userAgent.search("Chrome") < 0) {  
			jQuery("#transfersAndSession .sessionStartEnd label > input").attr('placeholder', '');
		}
	}

	// calendar Session
	{
		try {
			jQuery('#startSession').dateTimePicker({
		        monthName: ['Հունվ', 'Փետ', 'Մարտ', 'Ապր', 'Մայ', 'Հունի', 'Հուլ', 'Օգոս', 'Սեպ', 'Հոկ', 'Նոյ', 'Դեկ'], 
		        dayName: ['Կրի', 'Երկ', 'Երեք', 'Չոր', 'Հինգ', 'Ուրբ', 'Շաբ'],
		        limitMax: jQuery('#endSession') 
		    });
			jQuery('#endSession').dateTimePicker({
		        monthName: ['Հունվ', 'Փետ', 'Մարտ', 'Ապր', 'Մայ', 'Հունի', 'Հուլ', 'Օգոս', 'Սեպ', 'Հոկ', 'Նոյ', 'Դեկ'], 
		        dayName: ['Կրի', 'Երկ', 'Երեք', 'Չոր', 'Հինգ', 'Ուրբ', 'Շաբ'],
		        limitMin: $('#startSession') 
		    });
		} catch(e) {
			console.log(e);
		}
	}
	

	// table Info Session
    if(jQuery(window).width() > 1200){
    	pcTabelVersion();
    }else{
    	smartTabelVersion();
    }

    jQuery(window).resize(function(event) {
		if(jQuery(window).width() > 1200){
	    	pcTabelVersion();
	    }else{
    		smartTabelVersion();
	    }
    });

});


function pcTabelVersion(){
	var tabel = "";
    	tabel = "<table class='pctable'>\n<tr>";
    	for(var i in transferTabelInfo[0]){
    		tabel += "\n\t<th class='th'>"+i+"</th>\n";
    	}
    	tabel += "\n</tr>";

    	for(var i in transferTabelInfo){
    		tabel += "\n<tr class='tr'>";
    		for(var j in transferTabelInfo[i]){
    			tabel += "\n\t<td class='td'>"+transferTabelInfo[i][j]+"</td>\n";
    		}
    		tabel += "</tr>\n";
    	}
    	tabel += "\n</table>";
    	jQuery("#tabelSession").html(tabel);
}

function smartTabelVersion(){
	var tabel = "";

    for(var i in transferTabelInfo){
    	tabel += "<table class='smarttable'>\n";
    	for(var j in transferTabelInfo[i]){
    		tabel += "\n\t<tr class='tr'>\n\t<td class='td'>\t\t<span class='th'>" + j + "\t\t</span>"+transferTabelInfo[i][j]+"\t\n</td>\t\n</tr>" ;
    	}
    	tabel += "\n</table>";
	}

    jQuery("#tabelSession").html(tabel);
}